Lab-6/docs.org
#+TITLE: Enhanced Homework Program Manual
#+OPTIONS: toc:nil numbers:nil title:nil
* NAME
  homework-fork - Process files using multiple child processes with different delays and line reversal.

* SYNOPSIS
  **homework-fork** [OPTIONS] FILE...

* DESCRIPTION
  The `homework-fork` program processes input files using multiple child processes. Each child process has its own delay and can reverse lines before printing them. The parent process waits for all child processes to complete their tasks.

* OPTIONS
  - **-h**
    Display the help message.

  - **-r**
    Reverse each line before printing.

  - **-d [delay]**
    Specify a delay in seconds or fractions thereof. For example, `-d 0.5` adds a 500 milliseconds delay between lines.

* FILE
  Input files to be processed. Multiple files can be provided, and options can be in any order.

* EXIT STATUS
  0: Successful execution
  1: An error occurred

* EXAMPLES
  - Process a file with a 1-second delay and line reversal:
    #+BEGIN_SRC sh
    homework_fork -r -d 1 file.txt
    #+END_SRC

  - Process multiple files using forks:
    #+BEGIN_SRC sh
    homework_fork -d 0.5 file1.txt file2.txt
    #+END_SRC

* SEE ALSO
  - `man fork`
  - `man waitpid`
  - `man getline`

* NOTES
  This program creates a child process for each file argument, making it suitable for parallel processing. Each child has its own delay and can reverse lines.




